In [1]:
import numpy as np
import pandas as pd
import os
import sys
import datetime

## 1 读取预报文件

In [2]:
targetpath=r"D:\git仓库\GridForecastSys\extra_data\grid_data"
filename="Sample_new.txt"
fullname=os.path.join(targetpath,filename)
print(fullname)
#data=np.loadtxt(fullname)
# data=pd.read_table(targetpath,encoding = 'utf-8',header=None)
with open(fullname,"rb") as f:
    columns_date=pd.read_table(f,sep='\t',encoding='utf-8',nrows=1,header=None)
#     data=pd.read_table(f,sep='\t',encoding='utf-8',header=None,infer_datetime_format=True)
    print('读取成功')

D:\git仓库\GridForecastSys\extra_data\grid_data\Sample_new.txt
读取成功

#### 读取第一行

In [3]:
columns_date

,0,1,2,3,4,5,6,7,8,9,...,65,66,67,68,69,70,71,72,73,74
0,NaN,NaN,2018022608,2018022609,2018022610,2018022611,2018022612,2018022613,2018022614,2018022615,...,2018022823,2018030100,2018030101,2018030102,2018030103,2018030104,2018030105,2018030106,2018030107,2018030108

In [4]:
type(columns_date)

pandas.core.frame.DataFrame

In [5]:
print(columns_date[0][0])
type(columns_date[0][0])

nan

numpy.float64

### 数据清理
#### 处理nan

In [6]:
columns_date.notnull().head()

,0,1,2,3,4,5,6,7,8,9,...,65,66,67,68,69,70,71,72,73,74
0,False,False,True,True,True,True,True,True,True,True,...,True,True,True,True,True,True,True,True,True,True

In [7]:
columns_date.isnull()

,0,1,2,3,4,5,6,7,8,9,...,65,66,67,68,69,70,71,72,73,74
0,True,True,False,False,False,False,False,False,False,False,...,False,False,False,False,False,False,False,False,False,False

In [8]:
type(columns_date.notnull())

pandas.core.frame.DataFrame

In [9]:
type(columns_date.isnull())

pandas.core.frame.DataFrame

In [10]:
columns_date.isnull().values

array([[ True,  True, False, False, False, False, False, False, False,
        False, False, False, False, False, False, False, False, False,
        False, False, False, False, False, False, False, False, False,
        False, False, False, False, False, False, False, False, False,
        False, False, False, False, False, False, False, False, False,
        False, False, False, False, False, False, False, False, False,
        False, False, False, False, False, False, False, False, False,
        False, False, False, False, False, False, False, False, False,
        False, False, False]], dtype=bool)

* 此处有bug？

In [11]:
columns_date[columns_date.notnull()].head()

,0,1,2,3,4,5,6,7,8,9,...,65,66,67,68,69,70,71,72,73,74
0,NaN,NaN,2018022608,2018022609,2018022610,2018022611,2018022612,2018022613,2018022614,2018022615,...,2018022823,2018030100,2018030101,2018030102,2018030103,2018030104,2018030105,2018030106,2018030107,2018030108

* 取出的第一行类型

In [12]:
type(columns_date)

pandas.core.frame.DataFrame

In [14]:
columns_date[columns_date.notnull()]

,0,1,2,3,4,5,6,7,8,9,...,65,66,67,68,69,70,71,72,73,74
0,NaN,NaN,2018022608,2018022609,2018022610,2018022611,2018022612,2018022613,2018022614,2018022615,...,2018022823,2018030100,2018030101,2018030102,2018030103,2018030104,2018030105,2018030106,2018030107,2018030108

#### 1-2 df.dropna(axis=1)：删除所有包含空值的列

In [15]:
columns_date.dropna(axis=1)

,2,3,4,5,6,7,8,9,10,11,...,65,66,67,68,69,70,71,72,73,74
0,2018022608,2018022609,2018022610,2018022611,2018022612,2018022613,2018022614,2018022615,2018022616,2018022617,...,2018022823,2018030100,2018030101,2018030102,2018030103,2018030104,2018030105,2018030106,2018030107,2018030108

In [16]:
# 转成list
columns_date_convert=columns_date.dropna(axis=1)
columns_date_convert

,2,3,4,5,6,7,8,9,10,11,...,65,66,67,68,69,70,71,72,73,74
0,2018022608,2018022609,2018022610,2018022611,2018022612,2018022613,2018022614,2018022615,2018022616,2018022617,...,2018022823,2018030100,2018030101,2018030102,2018030103,2018030104,2018030105,2018030106,2018030107,2018030108

In [17]:
columns_date.dropna()

Empty DataFrame
Columns: [0, 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22, 23, 24, 25, 26, 27, 28, 29, 30, 31, 32, 33, 34, 35, 36, 37, 38, 39, 40, 41, 42, 43, 44, 45, 46, 47, 48, 49, 50, 51, 52, 53, 54, 55, 56, 57, 58, 59, 60, 61, 62, 63, 64, 65, 66, 67, 68, 69, 70, 71, 72, 73, 74]
Index: []

[0 rows x 75 columns]

In [18]:
columns_date.head()

,0,1,2,3,4,5,6,7,8,9,...,65,66,67,68,69,70,71,72,73,74
0,NaN,NaN,2018022608,2018022609,2018022610,2018022611,2018022612,2018022613,2018022614,2018022615,...,2018022823,2018030100,2018030101,2018030102,2018030103,2018030104,2018030105,2018030106,2018030107,2018030108

In [21]:
columns_date.astype(str)

,0,1,2,3,4,5,6,7,8,9,...,65,66,67,68,69,70,71,72,73,74
0,nan,nan,2018022608,2018022609,2018022610,2018022611,2018022612,2018022613,2018022614,2018022615,...,2018022823,2018030100,2018030101,2018030102,2018030103,2018030104,2018030105,2018030106,2018030107,2018030108

In [22]:
type(columns_date)

pandas.core.frame.DataFrame